rbac_cdc/app/controllers/getmenuinfo_controller.rb

	def get_role
		if params[:id]=="-1"
			@hash_role = {}
			render :partial => "roles"

		else
			@permission = StaticPermission.find(params[:id])
---
SELECT * FROM `static_permissions` WHERE (`static_permissions`.`id` = 2)

	def user_login
		  @user = User.new()
    	  @user.login = params[:user][:login]
    	  @user.password = params[:user][:password]

    	  role_user = params[:user][:role]
    	  @menu_user = params[:user][:menu]

    	  if role_user == nil || @menu_user == nil
    	  		flash[:notice] = "please choose partment and roles!!"

	    	  	redirect_to :action => :login
	      else
		      	#@users = User.find_by_login(@user.login)
	    	  @usr = User.find_by_credentials( @user.login, @user.password )

	    	  if @usr.nil? then
	    	  	flash[:notice] = "user name and pass are error!"

	    	  	redirect_to :action => :login
		  	  else

		  	  	@roles = @usr.roles
		  	  	@role = Role.find( role_user)

		  	  	#判断角色是否存在
		  	  	if @roles.include? @role then
			  	  	@perm = StaticPermission.find(@menu_user)
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 4)
SELECT `roles`.id FROM `roles` INNER JOIN `roles_users` ON `roles`.id = `roles_users`.role_id WHERE (`roles`.`id` = 4) AND (`roles_users`.user_id = 2 ) LIMIT 1
SELECT * FROM `static_permissions` WHERE (`static_permissions`.`id` = 2)
SELECT * FROM `users` WHERE (login = 'xiaohong') LIMIT 1