rbac_cdc/app/controllers/portals_controller.rb

  def list
    @portals = Portal.paginate :page => params[:page], :per_page => 10 #每页十条
---
SELECT * FROM `portals` LIMIT 0, 10

  def get_role
	if params[:id]=="-1"
		@hash_role = {}
		render :partial => "roles"

	else
		@permission = StaticPermission.find(params[:id])
---
SELECT * FROM `static_permissions` WHERE (`static_permissions`.`id` = 36)