rbac_cdc/app/controllers/roles_controller.rb

  def list
    #@role_pages, @roles = Role.paginate :page => params[:page], :per_page => 2 #每页两条
    @roles = Role.paginate :page => params[:page], :per_page => 10 #每页两条
---
SELECT * FROM `roles` LIMIT 0, 2
SELECT count(*) AS count_all FROM `roles`

  def create
    @role = Role.new(params[:role])

    # get an array of static permissions and set the permission associations
      params[:role][:static_permissions] = [] if params[:role][:static_permissions].nil?
      permissions = params[:role][:static_permissions].collect { |i| StaticPermission.find(i) }
      @role.static_permissions = permissions

    if @role.save
---
SELECT * FROM `static_permissions` WHERE (`static_permissions`.`id` = 2)
INSERT INTO `roles_static_permissions` (`static_permission_id`, `role_id`) VALUES (2, 3)
INSERT INTO `roles` (`created_at`, `updated_at`, `identifier`) VALUES('2008-12-30 03:24:00', '2008-12-30 03:25:07', 'admin')

  def edit
    @role = Role.find(params[:id])
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 4)

  def destroy
    Role.find(params[:id]).destroy
---
DELETE FROM `roles` WHERE `id` = 1
SELECT * FROM `roles` WHERE (`roles`.`id` = 1)