rbac_cdc/app/controllers/static_permissions_controller.rb

SELECT * FROM `static_permissions` LIMIT 0, 10
SELECT count(*) AS count_all FROM `static_permissions`
---
  def list
    @static_permissions = StaticPermission.paginate :page => params[:page], :per_page => 10 #每页十条