rbac_cdc/app/controllers/users_controller.rb

SELECT * FROM `users` LIMIT 0, 10
---
  def list
    @users = User.paginate :page => params[:page], :per_page => 10 #每页十条

SELECT * FROM `roles` WHERE (`roles`.`identifier` = 'admin') LIMIT 1
---
  def admin_login

  	if request.get?
  		#请求登陆页页
  		render :partial => "admin_login"
  		session[:admin_id] = nil
  	else
  		#进行登录验证
  		  @user = User.new
    	  @user.login = params[:user][:login]
    	  @user.password = params[:user][:password]

    	  @usr = User.find_by_credentials( @user.login, @user.password )

    	  if @usr.nil? then
    	  	flash[:notice] = "user name and pass are error!"

    	  	redirect_to :action => :admin_login
	  	  else

	  	  	@roles = @usr.roles

	  	  	#判断角色是否存在
	  	  	if @roles.include? Role.find_by_identifier('admin') then

SELECT * FROM `roles` WHERE (`roles`.`id` = 4)
INSERT INTO `users` (`created_at`, `password_hash_type`, `updated_at`, `password_salt`, `password`, `login`) VALUES('2008-12-30 03:47:00', 'sha1', '2008-12-30 03:47:14', 'eLaeSjUsgG', 'b8c5c9efd987dde86749c5e1bd24ae858f97741b', 'xiaohong')
SELECT * FROM `roles` INNER JOIN `roles_users` ON `roles`.id = `roles_users`.role_id WHERE (`roles_users`.user_id = 2 )
---
  def create
  	@role = Role.find(:all)

  	logger.info { params[:user] }
    @user = User.new(params[:user])
    @user.password = params[:password]
    @user.password_confirmation = params[:password_confirmation]
    logger.info { "-=-=-=-=-=-=-=-=-=-=-=user#{@user.password}" }
    if @user.save

	  params[:user][:roles] = [] if params[:user][:roles].nil?
      @user.roles = params[:user][:roles].collect { |i| Role.find(i) }